title: Test Whoami Detection
status: test
description: Detects whoami command execution
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains: 'whoami'
    condition: selection
level: medium
